#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.template_file.cb_app: Reading...
tls_private_key.bastion: Refreshing state... [id=161a6b5e631c819356fdc2c450325e1b82ac853c]
data.template_file.cb_app: Read complete after 0s [id=20ec471f6ed508e1a9949f87acae01e2d35f79952e4a0a39aedf8687ad99f5a6]
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
data.aws_secretsmanager_secret.github_token: Reading...
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
aws_codedeploy_app.application: Refreshing state... [id=e24dfba9-e70f-462d-82c3-31e4d10e40b5:application]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
data.aws_availability_zones.available: Reading...
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_codedeploy_deployment_group.deployment_group: Refreshing state... [id=c274e553-8b57-43b7-b18a-5390a24c4034]
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_cloudwatch_log_group.cb_log_group: Refreshing state... [id=/ecs/cb-app]
aws_ssm_parameter.bastion_key_pair: Refreshing state... [id=/test/bastion/ssh-key]
aws_key_pair.bastion_key_pair: Refreshing state... [id=bastion-key-test]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
data.aws_secretsmanager_secret.github_token: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
aws_cloudwatch_log_stream.cb_log_stream: Refreshing state... [id=cb-log-stream]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
aws_ecs_task_definition.app: Refreshing state... [id=cb-app-task]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole-20240816090310994000000001]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_lb_target_group.blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/1fb9b53178f17faf]
aws_lb_target_group.green_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/green-target-group/34044db384c4fb1c]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-01c3cdcddfa347799]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/main/ea7fde6e48daa652]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/main/ea7fde6e48daa652/d281553479d56640]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/cb-cluster/cb-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_codedeploy_app.application will be destroyed
  # (because aws_codedeploy_app.application is not in configuration)
  - resource "aws_codedeploy_app" "application" {
      - application_id   = "e24dfba9-e70f-462d-82c3-31e4d10e40b5" -> null
      - arn              = "arn:aws:codedeploy:eu-west-1:802288441694:application:application" -> null
      - compute_platform = "ECS" -> null
      - id               = "e24dfba9-e70f-462d-82c3-31e4d10e40b5:application" -> null
      - linked_to_github = false -> null
      - name             = "application" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }

  # aws_codedeploy_deployment_group.deployment_group will be destroyed
  # (because aws_codedeploy_deployment_group.deployment_group is not in configuration)
  - resource "aws_codedeploy_deployment_group" "deployment_group" {
      - app_name               = "application" -> null
      - arn                    = "arn:aws:codedeploy:eu-west-1:802288441694:deploymentgroup:application/deployment-group" -> null
      - autoscaling_groups     = [] -> null
      - compute_platform       = "ECS" -> null
      - deployment_config_name = "CodeDeployDefault.ECSAllAtOnce" -> null
      - deployment_group_id    = "c274e553-8b57-43b7-b18a-5390a24c4034" -> null
      - deployment_group_name  = "deployment-group" -> null
      - id                     = "c274e553-8b57-43b7-b18a-5390a24c4034" -> null
      - service_role_arn       = "arn:aws:iam::802288441694:role/codedeploy-service-role" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null

      - auto_rollback_configuration {
          - enabled = true -> null
          - events  = [
              - "DEPLOYMENT_FAILURE",
            ] -> null
        }

      - blue_green_deployment_config {
          - deployment_ready_option {
              - action_on_timeout    = "CONTINUE_DEPLOYMENT" -> null
              - wait_time_in_minutes = 0 -> null
            }
          - terminate_blue_instances_on_deployment_success {
              - action                           = "TERMINATE" -> null
              - termination_wait_time_in_minutes = 5 -> null
            }
        }

      - deployment_style {
          - deployment_option = "WITH_TRAFFIC_CONTROL" -> null
          - deployment_type   = "BLUE_GREEN" -> null
        }

      - ecs_service {
          - cluster_name = "cb-cluster" -> null
          - service_name = "cb-service" -> null
        }

      - load_balancer_info {
          - target_group_pair_info {
              - prod_traffic_route {
                  - listener_arns = [
                      - "arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/main/ea7fde6e48daa652/d281553479d56640",
                    ] -> null
                }
              - target_group {
                  - name = "blue-target-group" -> null
                }
              - target_group {
                  - name = "green-target-group" -> null
                }
            }
        }
    }

  # aws_ecs_service.main must be replaced
-/+ resource "aws_ecs_service" "main" {
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:eu-west-1:802288441694:service/cb-cluster/cb-service" -> (known after apply)
        name                               = "cb-service"
      ~ platform_version                   = "1.4.0" -> (known after apply)
      - propagate_tags                     = "NONE" -> null
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:802288441694:task-definition/cb-app-task:1" -> "arn:aws:ecs:eu-west-1:802288441694:task-definition/cb-app-task:3"
      ~ triggers                           = {} -> (known after apply)
        # (9 unchanged attributes hidden)

      - deployment_controller {
          - type = "CODE_DEPLOY" -> null # forces replacement
        }

      - load_balancer {
          - container_name   = "cb-app" -> null
          - container_port   = 3000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/cb-target-group/52bcaeea8f5483a5" -> null
        }
      + load_balancer {
          + container_name   = "dev-container"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/1fb9b53178f17faf"
        }
      + load_balancer {
          + container_name   = "dev-container"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/green-target-group/34044db384c4fb1c"
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*